tutorials/rStatAnalysis/oscillatingBubbleColumn/0.org/epsilon.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      epsilon.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.000248;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.000248;
    }
    outlet
    {
        type            inletOutlet;
        phi             phi.air;
        inletValue      uniform 0.000248;
        value           uniform 0.000248;
    }
    walls
    {
        type            epsilonWallFunction;
        value           uniform 0.000248;
    }
}


// ************************************************************************* //
